# ContourSettingItem Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ContourSettingItem Properties
ContourSettingItem Class See Also
---
The ContourSettingItem type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Start | The contour range start elevation. |
| Step | The increment elevation of the contour range. |
| Stop | The contour range stop elevation. |
| SubCategoryId | The contour line style subcategory id. |

# See Also
ContourSettingItem Class
Autodesk.Revit.DB Namespace